/**
 * Заполнить список названиями планет Солнечной системы 
 * в произвольном порядке с повторениями. 
 * Вывести название каждой планеты и количество его повторений в списке.
 */

package SEM_3;

import java.util.*;

public class Task_5 {
    public static void calculateUniqueCounter(List<String> strings) {
        Map<String, Integer> map = new HashMap<>();
        for (int i = 0; i < strings.size(); i++) {
            String word = strings.get(i); // sc.next();

            Integer count = map.get(word);
            count = (count != null) ? count + 1 : 1;

            map.put(word, count);
            System.out.println(map);
        }
    }

    public static void main(String[] args) {
        List<String> planets = List.of(
                "Меркурий",
                "Венера",
                "Земля",
                "Марс",
                "Юпитер",
                "Сатурн",
                "Уран",
                "Нептүн",
                "Плутон",
                "Марс",
                "Юпитер",
                "Земля",
                "Меркурий",
                "Меркурий");
        calculateUniqueCounter(planets);
    }
}

/**
 * в Терминале будет:
 * {Меркурий=1}
 * {Меркурий=1, Венера=1}
 * {Меркурий=1, Венера=1, Земля=1}
 * {Меркурий=1, Венера=1, Марс=1, Земля=1}
 * {Юпитер=1, Меркурий=1, Венера=1, Марс=1, Земля=1}
 * {Юпитер=1, Меркурий=1, Сатурн=1, Венера=1, Марс=1, Земля=1}
 * {Юпитер=1, Меркурий=1, Сатурн=1, Венера=1, Марс=1, Уран=1, Земля=1}
 * {Юпитер=1, Меркурий=1, Сатурн=1, Венера=1, Марс=1, Уран=1, Земля=1, Нептүн=1}
 * {Юпитер=1, Меркурий=1, Сатурн=1, Венера=1, Марс=1, Уран=1, Плутон=1, Земля=1,
 * Нептүн=1}
 * {Юпитер=1, Меркурий=1, Сатурн=1, Венера=1, Марс=2, Уран=1, Плутон=1, Земля=1,
 * Нептүн=1}
 * {Юпитер=2, Меркурий=1, Сатурн=1, Венера=1, Марс=2, Уран=1, Плутон=1, Земля=1,
 * Нептүн=1}
 * {Юпитер=2, Меркурий=1, Сатурн=1, Венера=1, Марс=2, Уран=1, Плутон=1, Земля=2,
 * Нептүн=1}
 * {Юпитер=2, Меркурий=2, Сатурн=1, Венера=1, Марс=2, Уран=1, Плутон=1, Земля=2,
 * Нептүн=1}
 * {Юпитер=2, Меркурий=3, Сатурн=1, Венера=1, Марс=2, Уран=1, Плутон=1, Земля=2,
 * Нептүн=1}
 */